#include<iostream>

/*
int main()
{
//基本概念
	//数据结构：相互之间存在一种或者多种特定关系的数据元素的集合。在逻辑上可以分为线性结构，散列
	//结构、树形结构，图形结构等等。
	//算法：求解具体问题的步骤描述，代码上表现出来是解决特定问题的一组有限的指令序列。
	//算法复杂度：时间和空间复杂度，衡量算法效率，算法在执行过程中，随着数据规模 n 的增长，算法执行所花费的时间和空间的增长速度。
	//常见的时间复杂度：
		//大 O 计法 应用示例
		//O(1)：数组随机访问、哈希表，常量时间（最好）
		//O(logn)：二分搜索、二叉堆调整、AVL、红黑树查找
		//O(n)：线性搜索
		//O(nlogn)：堆排序、快速排序、归并排序
		//O(n^2)：冒泡排序、选择排序、插入排序
		//O(2^n)：子集树
		//O(n!)：排列树
	//常见算法的时间复杂度关系：O(1) < O(logn) < O(n) < O(nlogn) < O(n^2) < O(2^n) < O(n!) < O(n^n)
	
	system("pause");
	return 0;
}
*/