#include<iostream>
using namespace std;

/*
//常量-常量与变量的区别-常量的使用 2025.10.12
#define Day 7 //宏常量

int main()
{
//第一个 C++ 程序-书写 Hello C++ 2025.10.12
	cout << "Hello C++" << endl;

//程序的注释-单行注释和多行注释
	//单行注释 "//"
	//多行注释 "/^ ^/" * 用 ^ 带替

//变量-变量的使用-变量的意义
	//注意：C++在创建变量时，必须给变量一个初始值，否则会报错
	//作用：给一段指定的内存空间起名，方便操作这段内存
	int a = 0;
	cout << "a = " << a << endl;

//常量-常量与变量的区别-常量的使用
	//用于记录程序中不可更改的数据
	//1.#define 宏常量
	//2.const 修饰的变量
	cout << "一周一共有： " << Day << "天" <<endl;
	const int month = 12;
	cout << "一年一共有： " << month << "月" << endl;

//关键字-C++常用的编程关键字
	//作用：关键字是C++中预先保留的单词（标识符）：在定义变量或者常量时候，不要用关键字

//标识符命名规则
	//作用：C++规定给标识符（变量、常量）命名时，有一套自己的规则
	//标识符不能是关键字
	//标识符只能由字母、数字、下划线组成
	//第一个字符必须为字母或下划线
	//标识符中字母区分大小写
	int abc_123 = 10;
	cout << abc_123 << endl;
	int aaa = 11;
	cout << aaa << endl;
	int AAA = 12;
	cout << AAA << endl;

	system("pause");
	return 0;
}
*/